// Задача 19 Напишите метод(-ы), который принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.Write ("введите пятизначное число : ");
int N = Convert.ToInt32(Console.ReadLine());

 
 
 

string NN (int N)
{
if (N<99999 && N>9999)
    {
    return "5 цифр";
    }
    Console.WriteLine ("не 5 цифр");
return "hj";
}

string Polindrom (int N)
{
 M=N%10;
 X=N/10000;

   
    
}




NN (N);



        